# 锐捷交换机

## 命令行介绍

命令行界面（Command Line Interface，CLI）是用户与网络设备进行文本指令交互的窗口，用户可以在命令行界面输入命令，实现对网络设备的配置和管理。

- **用户模式**：访问网络设备时**默认进入用户模式**（User EXEC模式），只可以使用少量命令，例如像show命令等，该模式下**操作结果不会被保存**。
- **特权模式**：可以使用更多的命令，在进入时必须输入特权模式的口令。该模式可以使用所有的特权命令，并且能够由此进入全局配置模式
- **配置模式**：要进入各种配置模式，首先必须进入全局配置模式。在全局配置模式下配置，可以进入接口配置模式等各种配置子模式。



**各个命令模式说明（假设网络设备的名称为Device）**



### 命令模式

#### 用户模式

- **访问方法**：访问网络设备时默认进入该模式
- **提示符**：Device>
- 离开或访问下一模式
  - 输入`exit`命令离开该模式
  - 要进入特权模式，输入`enable`命令
- **该模式的功能说明**：使用该模式来进行基本测试、显示系统信息



#### 特权模式

- **访问方法**：在用户模式下，使用`enable`命令进入该模式
- **提示符**：Device#
- 离开或访问下一模式：
  - 要返回到用户模式，输入`disable`命令
  - 要进入全局配置模式，输入`configure`命令
- **该模式的功能说明**：使用该模式来验证设置命令的结果。该模式是具有口令保护的



#### 全局配置模式

- **访问方法**：在特权模式下，使用`configure`命令进入该模式
- **提示符**：Device(config)#
- 离开或访问下一模式：
  - 要返回到特权模式，输入`exit`命令或`end`命令，或者键入`Ctrl+C`组合键
  - 要进入接口配置模式，输入`interface`命令。在`interface`命令中必须指明要进入哪一个接口配置子模式
  - 要进入VLAN配置模式，输入`vlan vlan-id`命令
- **该模式的功能说明**：使用该模式的命令来配置影响整个网络设备的全局参数



#### 接口配置模式

- **访问方法**：在全局配置模式下，使用`interface gigabitethernet 0/1`命令进入该模式
- **提示符**：Device(config-if-gigabitethernet 0/1)#
- 离开或访问下一模式：
  - 要返回到特权模式，输入`end`命令，或键入`Ctrl+C`组合键
  - 要返回到全局配置模式，输入`exit`命令。在`interface`命令中必须指明要进入哪一个接口配置子模式
- **该模式的功能说明**：使用该模式配置网络设备的各种接口



#### VLAN配置模式

- **访问方法**：在全局配置模式下，使用`vlan vlan-id`命令进入该模式
- **提示符**：Device(config-vlan)#
- 离开或访问下一模式：
  - 要返回到特权模式，输入`end`命令，或键入`Ctrl+C`组合键
  - 要返回到全局配置模式，输入`exit`命令
- **该模式的功能说明**：使用该模式配置VLAN参数



### 系统帮助

在任意模式的命令提示符下，输入问号（**?**）列出当前命令模式支持的命令及其描述信息。

```
Device> ?

Exec commands:
　<1-99>　　　Session number to resume
　disable　　 Turn off privileged commands
　disconnect　Disconnect an existing network connection
　enable　　　Turn on privileged commands
　exit　　　　Exit from the EXEC
　help　　　　Description of the interactive help system
　lock　　　　Lock the terminal
　ping　　　　Send echo messages
　show　　　　Show running system information
　telnet　　　Open a telnet connection
　traceroute　Trace route to destination
```



在一条命令的关键字后空格并输入问号（**?**），可以列出该关键字关联的下一个关键字或变量。

```
Device(config)# interface ?

　Aggregateport　　 Aggregate port interface
　Dialer　　　　　　Dialer interface
　GigabitEthernet　 Gigabit Ethernet interface
　Loopback　　　　　Loopback interface
　Multilink　　　　 Multilink-group　interface
　Null　　　　　　　Null interface
　Tunnel　　　　　　Tunnel interface
　Virtual-ppp　　　 Virtual PPP interface
　Virtual-template　Virtual Template interface
　Vlan　　　　　　　Vlan interface
　range　　　　　　 Interface range command
```



如果该关键字后带的是一个参数值，则列出该参数的取值范围及其描述信息，如下所示：

```
Device(config)# interface vlan ?

　<1-4094>　Vlan port number
```



在输入不完整的命令关键字后输入问号（**?**），可以列出以该字符串开头的所有命令关键字。

```
Device# d?

debug　delete　diagnostic　dir　disable　disconnect
```



在输入不完整的命令关键字后，如果该关键字后缀唯一，可以键入<Tab>键生成完整关键字。

```
Device# show conf<Tab>

Device# show configuration
```



在任何命令模式下，还可以通过**help**命令获取帮助系统的摘要描述信息。

```
Device(config)# help

Help may be requested at any point in a command by entering
a question mark '?'.　If nothing matches, the help list will
be empty and you must backup until entering a '?' shows the
available options.
Two styles of help are provided:
1. Full help is available when you are ready to enter a
　 command argument (e.g. 'show ?') and describes each possible
　 argument.
2. Partial help is provided when an abbreviated argument is entered
　 and you want to know what arguments match the input
　 (e.g. 'show pr?'.)
```



### 简写命令

关键字的一部分字符够识别唯一的命令关键字，就可以简写命令。

例如进入GigabitEthernet 0/1接口配置模式的命令**interface** **gigabitethernet** 0/1可以简写成：

```
Device(config)# int g0/1

Device(config-if-GigabitEthernet 0/1)#
```



###  命令的no和default选项

大部分命令有**no**选项。通常，使用**no**选项来禁止某个特性或功能，或者执行与命令本身相反的操作。例如，接口配置命令**no** **shutdown**执行关闭接口命令**shutdown**的相反操作，即打开接口。使用不带**no**选项的关键字，打开被关闭的特性或者打开缺省是关闭的特性。

配置命令大多有**default**选项，命令的**default**选项将命令的设置恢复为缺省值。大多数命令的缺省值是禁止该功能，因此在许多情况下**default**选项的作用和**no**选项是相同的。然而部分命令的缺省值是允许该功能，在这种情况下，**default**选项和**no**选项的作用是相反的。这时**default**选项打开该命令的功能，并将变量设置为缺省的允许状态。



### 错误命令的提示信息

当用户输入错误命令时，会弹出相应的错误提示信息。

**常见的CLI错误信息**

| 错误信息                                 | 含义                                                    | 如何获取帮助                                                 |
| ---------------------------------------- | ------------------------------------------------------- | ------------------------------------------------------------ |
| % Ambiguous command: "show c"            | 用户没有输入足够的字符，网络设备无法识别唯一的命令      | 重新输入命令，紧接着发生歧义的单词输入一个问号。可能输入的关键字将被显示出来 |
| % Incomplete command.                    | 用户没有输入该命令的必需的关键字或者变量参数            | 重新输入命令，输入空格再输入一个问号。可能输入的关键字或者变量参数将被显示出来 |
| % Invalid input detected at '^* marker.' | 用户输入命令错误，符号（'^'）指明了产生错误的单词的位置 | 在所在地命令模式提示符下输入一个问号，该模式允许的命令的关键字将被显示出来 |



### 历史命令

系统能够自动保存用户最近输入的历史命令，用户可以通过快捷键的方式查询、调用历史命令。

**操作方法**

| 操作               | 结果                                                         |
| ------------------ | ------------------------------------------------------------ |
| “Ctrl+P”或上方向键 | 在历史命令表中浏览前一条命令。从最近的一条记录开始，重复使用该操作可以查询更早的记录 |
| “Ctrl+N”或下方向键 | 在使用了“Ctrl+P”或上方向键操作之后，使用该操作在历史命令表中回到更近的一条命令。重复使用该操作可以查询更近的记录 |



### 编辑特性

用户在进行命令行编辑时，可以使用如下按键或快捷键：

**快捷键说明表**

| 功能                     | 按键、快捷键       | 说明                                                         |
| ------------------------ | ------------------ | ------------------------------------------------------------ |
| 在编辑行内移动光标       | 左方向键或“Ctrl+B” | 光标向左移动一个字符                                         |
| 在编辑行内移动光标       | 右方向键或“Ctrl+F” | 光标向右移动一个字符                                         |
| 在编辑行内移动光标       | “Ctrl+A”           | 光标移到命令行的首部                                         |
| 在编辑行内移动光标       | “Ctrl+E”           | 光标移到命令行的尾部                                         |
| 删除输入的字符           | Backspace键        | 删除光标左边的一个字符                                       |
| 删除输入的字符           | Delete键           | 删除光标右边的一个字符                                       |
| 输出时屏幕滚动一行或一页 | Return键           | 在显示内容时用回车键将输出的内容向上滚动一行，显示下一行的内容，仅在输出内容未结束时使用 |
| 输出时屏幕滚动一行或一页 | Space键            | 在显示内容时用空格键将输出的内容向上滚动一页，显示下一页内容，仅在输出内容未结束时使用 |

当编辑的光标接近右边界时，命令行会整体向左移动20个字符，命令行前部被隐藏的部分被符号（$）代替，可以使用相关按键或快捷键将光标移到前面的字符或者回到命令行的首部。

例如配置模式的命令**access-list**的输入可能超过一个屏幕的宽度。当光标第一次接近行尾时，命令行整体向左移动20个字符，命令行前部被隐藏的部分被符号（$）代替。每次接近右边界时都会向左移动20个字符长度。

```
access-list 199 permit ip host 192.168.180.220 host
$ost 192.168.180.220 host 202.101.99.12
$0.220 host 202.101.99.12 time-range tr
```

可以使用“Ctrl+A”快捷键回到命令行的首部，这时命令行尾部被隐藏的部分将被符号（$）代替：

```
access-list 199 permit ip host 192.168.180.220 host 202.101.99.$
```



### show命令的查找和过滤

要在**show**命令的输出信息中查找指定的内容，可以使用以下命令：

| 命令                                                         | 作用                                                         |
| ------------------------------------------------------------ | ------------------------------------------------------------ |
| **show** *any*-*command* \| [ **regexp** ] **begin** *regular*-*expression* | 在**show**命令的输出内容中查找指定的内容，将第一个包含该内容的行以及该行以后的全部信息输出 |

要在**show**命令的输出信息中过滤指定的内容，可以使用以下命令：

| **命令**                                                     | **作用**                                                     |
| ------------------------------------------------------------ | ------------------------------------------------------------ |
| **show** *any*-*command* \| [ **regexp** ] **exclude** *regular*-*expression* | 在**show**命令的输出内容中进行过滤，除了包含指定内容的行以外，输出其他的信息内容 |
| **show** *any*-*command* \| [ **regexp** ] **include** *regular*-*expression* | 在**show**命令的输出内容中进行过滤，仅输出包含指定内容的行，其他信息将被过滤 |



**说明**：

- 支持在任意模式下执行**show**命令。
- 查找的信息内容需要区分大小写。



当指定**regexp**关键字时，过滤的内容可以使用正则表达式。以下简要介绍正则表达式中特殊字符的用法。

| **字符** | **符号** | **特殊意义**                             |
| -------- | -------- | ---------------------------------------- |
| 句号     | .        | 匹配任意单字符                           |
| 加号     | +        | 匹配字符串中的一个或者任意序列           |
| 加字号   | ^        | 匹配字符串的开始                         |
| 下划线   | _        | 匹配逗号、括号、字符串的开始和结束、空格 |
| 方括号   | [ ]      | 匹配一定范围中的单个字符                 |



要在**show**命令的输出内容中进行查找和过滤，需要输入管道符号（竖线，“|”）。在管道字符之后，可以选择查找和过滤的规则和查找和过滤的内容（字符或字符串），并且查找和过滤的内容需要区分大小写：

```
Device# show running-config | include interface

interface GigabitEthernet 0/0
interface GigabitEthernet 0/1
interface GigabitEthernet 0/2
interface GigabitEthernet 0/3
interface GigabitEthernet 0/4
interface GigabitEthernet 0/5
interface GigabitEthernet 0/6
interface GigabitEthernet 0/7
interface Mgmt 0

Device# show running-config | regexp include GigabitEthernet [0-9]/1

interface GigabitEthernet 0/1
```

